---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList{System.Boolean})
source: html/fd6d2789-8499-512b-bae5-342b4a432570.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IList<bool> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.IList < Boolean >`)